Fabrication ancillary database identifier.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 17.0.0.0 (17.0.1090.0)
  Since:  2017 Subscription Update
 Syntax
  C#
public int AncillaryId { get; }
  Visual Basic
Public ReadOnly Property AncillaryId As Integer
	Get
  Visual C++
public:
property int AncillaryId {
	int get ();
}
 See Also
  FabricationAncillaryUsage Class
  Autodesk.Revit.DB Namespace